app/controllers/admin/ajax_products_controller.rb

  def update
    respond_to do |format|
      if @product.update_attributes(item_params)
---
UPDATE "products" SET "product_type" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["product_type", "not drink"], ["updated_at", "2016-05-23 17:06:16.906934"], ["id", 1]]

  def find_item
    @product = Product.where(id: params[:id]).first
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ?  ORDER BY "products"."id" ASC LIMIT 1  [["id", 4]]