app/controllers/admin/ajax_coctailes_controller.rb

  def index
    @coctailes = Coctaile.all
---
SELECT "coctailes".* FROM "coctailes"

  def update
    find_item
    respond_to do |format|
      if @coctaile.update_attributes(item_params)
---
UPDATE "coctailes" SET "value" = ?, "updated_at" = ? WHERE "coctailes"."id" = ?  [["value", 200.0], ["updated_at", "2016-05-23 16:30:07.060724"], ["id", 1]]

  def destroy
    @coctaile.destroy
---
DELETE FROM "coctailes" WHERE "coctailes"."id" = ?  [["id", 4]]

  def find_item
    @coctaile = Coctaile.where(id: params[:id]).first
---
SELECT  "coctailes".* FROM "coctailes" WHERE "coctailes"."id" = ?  ORDER BY "coctailes"."id" ASC LIMIT 1  [["id", 4]]