app/controllers/admin/coctailes_controller.rb

  def index
    @coctailes = Coctaile.includes(:ingredients, :products)
---
SELECT "coctailes".* FROM "coctailes"
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."coctaile_id" IN (1, 2, 3, 4)
SELECT "products".* FROM "products" WHERE "products"."id" IN (1, 2, 3, 4, 5)

  def update
    @coctaile.update_attributes item_params
---
UPDATE "coctailes" SET "image" = ?, "updated_at" = ? WHERE "coctailes"."id" = ?  [["image", "any.jpg"], ["updated_at", "2016-05-23 14:34:14.887455"], ["id", 1]]

  def find_item
    @coctaile = Coctaile.where(id: params[:id]).first
---
SELECT  "coctailes".* FROM "coctailes" WHERE "coctailes"."id" = ?  ORDER BY "coctailes"."id" ASC LIMIT 1  [["id", 1]]