app/views/welcome/show_coctaile.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."coctaile_id" = ?  [["coctaile_id", 1]]
---
    <div class="col-sm-5 cols-sm-offset-1">
      <% @coctaile.ingredients.each do |ingredient| %>